tutorials/6.3.1.1D_2phase_2componentLiq_Solve_XCO2_1_compositionalDarcyFoam/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions                    [1 -1 -2 0 0 0 0];
internalField                 uniform  1e7;
boundaryField
{
    inlet
    {
        type		zeroGradient;
    }
    outlet
    {
       	type            fixedValue ;
       	value		uniform 1e7;     
    }	
    yzfaces
    {
        type            empty;
    }
}


//************************************************************************** //
